// Global variables
/* beautify preserve:start */

(function(angular) {
  'use strict';
  angular.module('app')
    .value('Province', {

      '서울': [
        {text: '강남/역삼/서초'},
        {text: '잠실/신천'},
        {text: '영등포/구로/금천'},
        {text: '강서/화곡/까치산역/목동'},
        {text: '천호/길동/둔촌'},
        {text: '서울대/신림/사당'},
        {text: '종로/명동/용산'},
        {text: '수유/성북/도봉/노원/대학로'},
        {text: '왕십리/성수/건대'},
        {text: '동대문/장안/중랑/상봉'},
        {text: '홍대/신촌/은평'}
      ],

      '경기': [
        {text: '수원/인계/권선/세류/영통'},
        {text: '수원역/팔달문/북문/구운/장안'},
        {text: '안성/평택/송탄'},
        {text: '오산/화성'},
        {text: '파주/일산/김포'},
        {text: '의정부/양주'},
        {text: '부천'},
        {text: '과천/안양/군포/의왕'},
        {text: '안산'},
        {text: '광명/시흥'},
        {text: '용인/이천/여주'},
        {text: '성남'},
        {text: '구리/하남/남양주/가평/양평'},
        {text: '포천/동두천/연천'}
      ],

      '인천': [
        {text: '부평'},
        {text: '주안'},
        {text: '계양/서구/동암/남동구'},
        {text: '남구/동구/중구'},
        {text: '송도/강화/옹진'}
      ],

      '강원': [
        {text: '경포대/강릉/정동진'},
        {text: '속초/양양/고성'},
        {text: '춘천/홍천/인제'},
        {text: '원주/횡성'},
        {text: '동해/삼천/태백'},
        {text: '평창/영월/정선'}
      ],

      '부산': [
        {text: '해운대/재송'},
        {text: '송정/기장'},
        {text: '서면/초읍/양정'},
        {text: '연산/토곡'},
        {text: '동래/온천장/부산대'},
        {text: '부산역/남포동/송도/영도'},
        {text: '광안리/경성대/남구'},
        {text: '사상/덕천/북구'},
        {text: '하단/사하/명지'}
      ],

      '경남': [
        {text: '김해/장유'},
        {text: '양산/밀양'},
        {text: '거제/통영'},
        {text: '진주/사천/남해/고성'},
        {text: '창원/진해'},
        {text: '마산'},
        {text: '거창/산청/의령/합천'}
      ],

      '대구': [
        {text: '동성로/수성구/남구/서구'},
        {text: '동대구역/경북대/신천/북구'},
        {text: '성서/죽전/달서구'}
      ],

      '경북': [
        {text: '경주'},
        {text: '구미/김천'},
        {text: '포항/영덕/울진'},
        {text: '영천/칠곡/경산/청도'},
        {text: '문경/상주/안동/영주/청송'}
      ],

      '대전': [
        {text: '중구/은행'},
        {text: '유성'},
        {text: '동구/대덕/용전'},
        {text: '서구/둔산/괴정'}
      ],

      '충남': [
        {text: '천안/세종'},
        {text: '계룡/공주/금산/논산/영동'},
        {text: '아산/예산/청양/홍성'},
        {text: '태안/당진/안면도/서산'},
        {text: '대천/보령/서천/부여'}
      ],

      '충북': [
        {text: '청주'},
        {text: '충주/제천/단양'},
        {text: '증평/진천/음성/괴산'}
      ],

      '광주': [
        {text: '광산구/북구/동구'},
        {text: '서구/남구'}
      ],

      '전남': [
        {text: '순천/여수/광양'},
        {text: '목포/무안/해남/나주'},
        {text: '화순/고흥/담양/장성/곡성'}
      ],

      '울산': [
        {text: '남구/중구'},
        {text: '동구/울주군'}
      ],

      '전북': [
        {text: '전주'},
        {text: '군산/익산'},
        {text: '김제/부안/임실/정읍'}
      ],

      '제주': [
        {text: '제주시'},
        {text: '서귀포'}
      ]

    });
})(angular);
/* beautify preserve:end */
